var data=[];

var dataStr ='1、木星上行<br>\
<br>\
国    家：美国 / 英国<br>\
类    型：动作 / 科幻 / 冒险<br>\
语    言：英语 / 俄语<br>\
字    幕：中英双字幕<br>\
上映日期：2015-03-06(中国大陆)<br>\
片    长：126分钟<br>\
导    演：安迪·沃卓斯基 / 拉娜·沃卓斯基<br>\
主    演: 查宁·塔图姆 / 米拉·库妮丝 / 肖恩·宾 / 埃迪·雷德梅恩...等<br>\
<br>\
<br>\
2、伪造者<br>\
<br>\
国    家：美国<br>\
类    型：剧情 / 犯罪 / 惊悚<br>\
语    言：英语<br>\
字    幕：中英双字幕<br>\
上映日期：2015-04-24(美国)<br>\
片    长：92分钟<br>\
导    演：菲利普·马丁<br>\
主    演: 约翰·特拉沃尔塔 / 詹妮弗·艾莉 / 安松·蒙特 / 克里斯托弗·普卢默...等<br>\
<br>\
<br>\
3、贵族大盗<br>\
<br>\
国    家：美国 / 英国<br>\
类    型：动作 / 喜剧<br>\
语    言：英语<br>\
字    幕：中英双字幕<br>\
上映日期：2015-01-23(中国大陆)<br>\
片    长：107分钟<br>\
导    演：大卫·凯普<br>\
主    演: 约翰尼·德普 / 格温妮斯·帕特洛 / 保罗·贝坦尼 / 伊万·麦克格雷格...等<br>\
<br>\
<br>\
4、美国狙击手<br>\
<br>\
国    家：美国<br>\
类    型：战争 / 传记 / 动作<br>\
语    言：英语<br>\
字    幕：中英双字幕<br>\
上映日期：2015-01-16(美国)<br>\
片    长：132分钟<br>\
导    演：克林特·伊斯特伍德<br>\
主    演: 布莱德利·库珀 / 西耶娜·米勒 / 杰克·麦克道曼 / 凯尔·加尔纳...等<br>\
<br>\
<br>\
5、钟馗伏魔<br>\
<br>\
国    家：中国大陆 / 美国<br>\
类    型：动作 / 爱情 / 奇幻<br>\
语    言：汉语普通话<br>\
字    幕：中英双字幕<br>\
上映日期：2015-02-19(中国大陆)<br>\
片    长：118分钟<br>\
导    演：鲍德熹 / 赵天宇<br>\
主    演: 陈坤 / 李冰冰 / 赵文瑄 / 杨子姗...等<br>\
<br>\
<br>\
6、鸣梁海战<br>\
<br>\
国    家：韩国<br>\
类    型：动作 / 剧情 / 传记<br>\
语    言：韩语<br>\
字    幕：简体中文字幕<br>\
上映日期：2014-12-12(中国大陆)<br>\
片    长：109分钟<br>\
导    演：金韩民<br>\
主    演: 崔岷植 / 柳承龙 / 赵震雄 / 晋久...等<br>\
<br>\
<br>\
7、飓风营救3<br>\
<br>\
国    家：法国<br>\
类    型：动作 / 犯罪 / 惊悚<br>\
语    言：英语 / 俄语<br>\
字    幕：中英双字幕<br>\
上映日期：2015-03-20(中国大陆)<br>\
片    长：109分钟<br>\
导    演：奥利维尔·米加顿<br>\
主    演: 连姆·尼森 / 福里斯特·惠特克 / 法米克·詹森 / 玛姬·格蕾斯...等<br>\
<br>\
<br>\
8、澳门风云2<br>\
<br>\
国    家：香港 / 中国大陆<br>\
类    型：动作 / 喜剧<br>\
语    言：汉语普通话<br>\
字    幕：简体中文字幕<br>\
上映日期：2015-02-19(中国大陆)<br>\
片    长：110分钟<br>\
导    演：王晶 / 张敏<br>\
主    演: 周润发 / 张家辉 / 刘嘉玲 / 余文乐...等<br>\
<br>\
<br>\
9、爸爸去哪儿2大电影<br>\
<br>\
国    家：中国大陆<br>\
类    型：家庭 / 儿童 / 真人秀<br>\
语    言：汉语普通话<br>\
字    幕：简体中文字幕<br>\
上映日期：2015-02-19(中国大陆)<br>\
片    长：96分钟<br>\
导    演：谢涤葵 / 林妍<br>\
主    演: 杨威 / 杨阳洋 / 黄磊 / 黄忆慈...等<br>\
<br>\
<br>\
10、匆匆那年<br>\
<br>\
国    家：中国<br>\
类    型：爱情<br>\
语    言：汉语普通话<br>\
字    幕：中英双字幕<br>\
上映日期：2014-12-05(中国大陆)<br>\
片    长：119分钟<br>\
导    演：张一白<br>\
主    演: 彭于晏 / 倪妮 / 郑恺 / 魏晨...等<br>\
<br>\
<br>\
11、星际穿越<br>\
<br>\
国    家：美国 / 英国 / 加拿大<br>\
类    型：科幻 / 冒险<br>\
语    言：英语<br>\
字    幕：中英双字幕<br>\
上映日期：2014-11-12(中国大陆)<br>\
片    长：169分钟<br>\
导    演：克里斯多夫诺兰<br>\
主    演: 马修麦康纳 / 安海瑟葳 / 洁西卡崔丝妲 / 米高肯恩...等<br>\
<br>\
<br>\
12、霍比特人3五军之战<br>\
<br>\
国    家：美国 / 新西兰<br>\
类    型：动作 / 奇幻 / 冒险<br>\
语    言：英语<br>\
字    幕：中英双字幕<br>\
上映日期：2015-01-23(中国大陆)<br>\
片    长：144分钟<br>\
导    演：彼得•杰克逊<br>\
主    演: 马丁•弗瑞曼 / 伊恩•麦克莱恩 / 理查德•阿米蒂奇 / 伊万杰琳•莉莉...等<br>\
<br>\
<br>\
13、博物馆奇妙夜3<br>\
<br>\
国    家：美国<br>\
类    型：喜剧 / 奇幻 / 冒险<br>\
语    言：英语<br>\
字    幕：中英双字幕<br>\
上映日期：2015-01-04(中国大陆)<br>\
片    长：98分钟<br>\
导    演：肖恩·利维<br>\
主    演: 本·斯蒂勒 / 罗宾·威廉姆斯 / 丹·史蒂文斯 / 欧文·威尔逊...等<br>\
<br>\
<br>\
14、催眠大师<br>\
<br>\
国    家：中国大陆<br>\
类    型：剧情 / 悬疑 / 惊悚<br>\
语    言：汉语普通话<br>\
字    幕：简体中文字幕<br>\
上映日期：2014-04-29(中国大陆)<br>\
片    长：102分钟<br>\
导    演：陈正道<br>\
主    演: 徐峥 / 莫文蔚 / 吕中 / 王耀庆...等<br>\
';

var d = dataStr.split('<br><br><br>')
for(var i=0;i<d.length;i++){
	var c = d[i].split('<br><br>');
	data.push({
		img:c[0].replace('、',' ')+'.jpg',
		caption: c[0].split('、')[1],
		desc : c[1]
	});
	console.log(c[0].replace('、','')+'.jpg');
}